# Shell Permissions Scripts
### Scripts
---
`0-alias`
> The script creates an alias name: `ls` with a value: `rm *`
---
`1-hello_you`
> The script prints hello user, where user is the current Linux user.
---
`2-path`
> The script Add `/action` to the `PATH`. `/action` shall be the last directory the shell looks into when looking for a program.
---
`3-paths`
> The script counts the number of directories in the `PATH`.
---
`4-global_variables`
> The script lists environment variables.
---
`5-local_variables`
> The script lists all local variables and environment variables, and functions.
---
`6-create_local_variable`
> The script creates a new local variable with the Name: `BEST` and Value: `School`.
---
`7-create_global_variable`
> The script creates a new global variable with the Name: `BEST` and Value: `School`.
---
`8-true_knowledge`
> The script prints the result of the addition of 128 with the value stored in the environment variable `TRUEKNOWLEDGE`, followed by a new line.
---
`9-divide_and_rule`
> The script prints the result of `POWER` divided by `DIVIDE`, followed by a new line.
---
`10-love_exponent_breath`
> The script displays the result of `BREATH` to the power `LOVE`
---
`11-binary_to_decimal`
> The script converts a number from base 2 to base 10. The number in base 2 is stored in the environment variable `BINARY`. The script shall  display the number in base 10, followed by a new line
---
`12-combinations`
> The script prints all possible combinations of two letters, except `oo`. Letters are lower cases, from `a` to `z` with one combination per line. The output shall be alpha ordered, starting with `aa`
---
`13-print_float`
> The script  prints a number with two decimal places, followed by a new line. The number is then stored in the environment variable `NUM`.
---
`100-decimal_to_hexadecimal`
> The script converts a number from base 10 to base 16. The number in base 10 is stored in the environment variable `DECIMAL`. The script will then  display the number in base 16, followed by a new line.
---
`101-rot13`
> The script  encodes and decodes text using the rot13 encryption. Assume ASCII.
---
`102-odd`
> The script prints every other line from the input, starting with the first line.
---
`103-Star_Wars`
> The script will play the StarWars IV episode in the terminal.
---
